Kang/LF_50/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    interphase
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    tank_wall
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

    wedge0
    {
        type            wedge;
    }

    wedge1
    {
        type            wedge;
    }
}

// ************************************************************************* //
