Kang/LF_50/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqPvapFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8000;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   60;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDeltaT	5e-2;

maxCo           0.5;

functions
{
    p_average
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    adjustableRunTime;
        writeInterval   1;
        writeFields     false;
        regionType      all;
        operation       volAverage;

        fields
        (
            pvap
        );
    }
}

// ************************************************************************* //
